app/model/customer.php

select `customer_id` from `map_customer_salespersons` where `is_executive_for_life` = '0'
---
    public static function customerlisting($query,$qty)
    {
        if(Auth::user()->user_type!='SP')
        {
        $custom_ids = DB::table('map_customer_salespersons')->select('customer_id')->where('is_executive_for_life', '=','0')->get();

select `customer_id` from `map_customer_salespersons` where `user_id` = '6' and `is_executive_for_life` = '0'
---

        if(isset($query['sales_person']) && $query['sales_person']!='')
        {
            $custom_ids = DB::table('map_customer_salespersons')->select('customer_id')->where('user_id', '=',$query['sales_person'])->where('is_executive_for_life', '=','0')->get();

select `customer_id` from `map_customer_salespersons` where `is_executive_for_life` = '0'
---
    public static function loadAjaxcustomer($query,$qty,$id)
    {
         if(Auth::user()->user_type!='SP')
        {
        $custom_ids = DB::table('map_customer_salespersons')->select('customer_id')->where('is_executive_for_life', '=','0')->get();

select `customer_id` from `map_customer_salespersons` where `user_id` = '6'
---

        if(isset($query['sales_person']) && $query['sales_person']!='')
        {
            $custom_ids = DB::table('map_customer_salespersons')->select('customer_id')->where('user_id', '=',$query['sales_person'])->get();

select count(*) as aggregate from `customers` where `outside_FA_updated_on` > '2019-04-01'
---
    public static function countFAupdate($date) {
        if (Auth::user()->user_type != 'SP') {
            return customer::select('id')
                            ->where('outside_FA_updated_on', '>', $date)->count();