app/model/customer_contact_person.php

select `custom_id`, `contact_person_name`, `contact_person_phone1`, `contact_person_email1` from `customer_contact_persons` where `id` = '5'
---
   public static function persondetails($id)
   {
      $details = customer_contact_person::select('custom_id','contact_person_name','contact_person_phone1','contact_person_email1')
                        ->where('id', $id)
                        ->get();

      if ($details->count()) {
          $details = $details->first()->toArray();