app/model/Lead_product.php

  public static function fetchprodid($id)
  {
      $all_prod = Lead_product::select('prod_id')->where('lead_id', '=', $id)->get();
---
select `prod_id` from `lead_products` where `lead_id` = '14'

	public static function fetchprod($id)
    {
      	$all_prod = Lead_product::select('*')->where('lead_id', '=', $id)->get();
---
select * from `lead_products` where `lead_id` = '14'

  public static function deleteleadproduct($id)
  {
       Lead_product::where('lead_id', '=', $id)->delete();
---
delete from `lead_products` where `lead_id` = '65'