app/model/Lead_activity_mode.php

select `id`, `activity_mode` from `lead_activity_modes` where `is_active` = '1' order by `activity_mode` asc
---
    public static function fetchmodes() {
        $resp = Lead_activity_mode::select('id', 'activity_mode')->where('is_active', '=', '1')->orderBy('activity_mode')->get();