app/model/Lead_activity.php

insert into `lead_activities` (`lead_id`, `activity_time`, `activity_type`, `lead_activity_mode_id`, `activity_note`, `activity_done_by_user_id`) values ('65', '2019-04-08 07:50:18', '1', '0', 'edited', '1')
---
    public static function insertactivity($id, $note, $act_type, $act_mode) {
        $lead_activity = new Lead_activity;
        $lead_activity->lead_id = $id;
        $lead_activity->activity_time = date('Y-m-d H:i:s');
        $lead_activity->activity_type = $act_type;
        $lead_activity->lead_activity_mode_id = $act_mode;
        $lead_activity->activity_note = $note;
        $lead_activity->activity_done_by_user_id = Auth::id();
        $lead_activity->save();