app/model/Lead.php

    public static function editlead($data)
    {
        $lead_detail = Lead::find($data['id']);
        $lead_detail->customer_contact_person_id = $data['customer_contact_person_id'];
        if (Auth::user()->user_type != 'SP')
        {
            $lead_detail->sales_person_id = $data['sales_person_id'];
        }
        $lead_detail->is_active = $data['is_active'];
        $lead_detail->lead_source = $data['lead_source'];
        $lead_detail->additional_info = $data['additional_info'];
        $lead_detail->lead_strength_id = $data['lead_strength_id'];
        $lead_detail->updated_at = $data['updated_at'];
---
select * from `leads` where `leads`.`id` = '65' limit 1
update `leads` set `sales_person_id` = '33', `updated_at` = '2019-04-08 07:50:18' where `id` = '65'

    public static function getlead($id)
    {
        $results = Lead::find($id)->toArray();
---
select * from `leads` where `leads`.`id` = '14' limit 1

    public static function fetchleads($perPage)
    {
        $all_lead = Lead::select('leads.id', 'leads.custom_id', 'leads.customer_contact_person_id', 'leads.sales_person_id', 'leads.lead_strength_id', 'leads.updated_at','leads.is_completed', 'leads.is_active','l.loan_type','p.margin_value', DB::raw('COUNT(p.prod_id) as totprod'), DB::raw('sum(p.margin_value * p.quantity) as valuation'),'p.quantity','c.company_name','c.registration_number','cc.display_name','mcs.lead_started_on','mcs.is_executive_for_life','mcs.is_lead_on_hold')
       		->leftjoin('lead_strengths as l', 'l.id', '=', 'leads.lead_strength_id')
       		->leftjoin('lead_products as p', 'p.lead_id', '=', 'leads.id')
       		->leftjoin('customers as c', 'c.id', '=', 'leads.custom_id')
       		->leftjoin('users as cc', 'cc.id', '=', 'leads.sales_person_id')
                ->leftjoin('map_customer_salespersons as mcs', 'mcs.customer_id', '=', 'c.id');


        if(Auth::user()->user_type=='SP')
        {
            $all_lead->where('sales_person_id','=',Auth::id())->where('leads.is_active','=','1');
        }

        $all_lead = $all_lead->groupBy('leads.id')->orderBy('leads.id', 'DESC')->limit($perPage)->get();
---
select `leads`.`id`, `leads`.`custom_id`, `leads`.`customer_contact_person_id`, `leads`.`sales_person_id`, `leads`.`lead_strength_id`, `leads`.`updated_at`, `leads`.`is_completed`, `leads`.`is_active`, `l`.`loan_type`, `p`.`margin_value`, COUNT(p.prod_id) as totprod, sum(p.margin_value * p.quantity) as valuation, `p`.`quantity`, `c`.`company_name`, `c`.`registration_number`, `cc`.`display_name`, `mcs`.`lead_started_on`, `mcs`.`is_executive_for_life`, `mcs`.`is_lead_on_hold` from `leads` left join `lead_strengths` as `l` on `l`.`id` = `leads`.`lead_strength_id` left join `lead_products` as `p` on `p`.`lead_id` = `leads`.`id` left join `customers` as `c` on `c`.`id` = `leads`.`custom_id` left join `users` as `cc` on `cc`.`id` = `leads`.`sales_person_id` left join `map_customer_salespersons` as `mcs` on `mcs`.`customer_id` = `c`.`id` group by `leads`.`id` order by `leads`.`id` desc limit 10

    public static function loadAjaxlead($perPage,$id)
    {
        $all_lead = Lead::select('leads.id', 'leads.custom_id', 'leads.customer_contact_person_id', 'leads.sales_person_id', 'leads.lead_strength_id', 'leads.updated_at','leads.is_completed', 'leads.is_active','l.loan_type','p.margin_value', DB::raw('COUNT(p.prod_id) as totprod'), DB::raw('sum(p.margin_value * p.quantity) as valuation'),'p.quantity','c.company_name','c.registration_number','cc.display_name','mcs.lead_started_on','mcs.is_executive_for_life','mcs.is_lead_on_hold')
       		->leftjoin('lead_strengths as l', 'l.id', '=', 'leads.lead_strength_id')
       		->leftjoin('lead_products as p', 'p.lead_id', '=', 'leads.id')
       		->leftjoin('customers as c', 'c.id', '=', 'leads.custom_id')
       		->leftjoin('users as cc', 'cc.id', '=', 'leads.sales_person_id')
                ->leftjoin('map_customer_salespersons as mcs', 'mcs.customer_id', '=', 'c.id');

        if(isset($id) && $id!='')
        {
            $all_lead->where('leads.id', '<', $id);
        }
        if(Auth::user()->user_type=='SP')
        {
            $all_lead->where('sales_person_id','=',Auth::id())->where('leads.is_active','=','1');
        }
        /*echo $ajaxlead = $all_lead->groupBy('leads.id')
            ->orderBy('leads.id', 'DESC')
            ->limit($perPage)
            ->toSql();*/
       	$ajaxlead = $all_lead->groupBy('leads.id')
            ->orderBy('leads.id', 'DESC')
            ->limit($perPage)
       		->get();
---
select `leads`.`id`, `leads`.`custom_id`, `leads`.`customer_contact_person_id`, `leads`.`sales_person_id`, `leads`.`lead_strength_id`, `leads`.`updated_at`, `leads`.`is_completed`, `leads`.`is_active`, `l`.`loan_type`, `p`.`margin_value`, COUNT(p.prod_id) as totprod, sum(p.margin_value * p.quantity) as valuation, `p`.`quantity`, `c`.`company_name`, `c`.`registration_number`, `cc`.`display_name`, `mcs`.`lead_started_on`, `mcs`.`is_executive_for_life`, `mcs`.`is_lead_on_hold` from `leads` left join `lead_strengths` as `l` on `l`.`id` = `leads`.`lead_strength_id` left join `lead_products` as `p` on `p`.`lead_id` = `leads`.`id` left join `customers` as `c` on `c`.`id` = `leads`.`custom_id` left join `users` as `cc` on `cc`.`id` = `leads`.`sales_person_id` left join `map_customer_salespersons` as `mcs` on `mcs`.`customer_id` = `c`.`id` where `leads`.`id` < '14' group by `leads`.`id` order by `leads`.`id` desc limit 10

    public static function get_leads_by_id($status, $id, $time = '') {
        $all_lead = Lead::select('leads.id', 'leads.custom_id', 'leads.customer_contact_person_id', 'leads.sales_person_id', 'leads.lead_strength_id', 'leads.updated_at', 'leads.lead_created_on', 'leads.lead_completed_date', 'leads.is_completed', 'leads.is_active');

        if ($status == 'close') {
            $all_lead->where('leads.is_completed', '=', '1');
        } elseif ($status == 'dead') {
            $all_lead->where('leads.is_active', '=', '0');
        } elseif ($status == 'new') {
            $all_lead->where('leads.lead_strength_id', '=', '0')->where('leads.is_completed', '=', '0')->where('leads.is_active', '=', '1');
        } elseif ($status == 'open') {
            $all_lead->where('leads.lead_strength_id', '<>', '0')->where('leads.is_completed', '=', '0')->where('leads.is_active', '=', '1');
        }
        if ($time == 1) {
            $dtime = date('Y-m-d', strtotime('-1 days'));
            $all_lead->where('leads.lead_created_on', '>=', $dtime);
        } else if ($time == 2) {
            $dtime = date('Y-m-d', strtotime('-7 days'));
            $all_lead->where('leads.lead_created_on', '>=', $dtime);
        } else if ($time == 3) {
            $dtime = date('Y-m-d', strtotime('-1 MONTH'));
            $all_lead->where('leads.lead_created_on', '>=', $dtime);
        } else if ($time == 4) {
            $dtime = date('Y-m-d', strtotime('-1 YEAR'));
            $all_lead->where('leads.lead_created_on', '>=', $dtime);
        }
        if ($id != 0) {
        $all_lead = $all_lead->where('leads.sales_person_id', '=', $id);
        }
        if (Auth::user()->user_type == 'SP')
        {
            $all_lead = $all_lead->where('leads.sales_person_id', '=', Auth::user()->id);
---
select `leads`.`id`, `leads`.`custom_id`, `leads`.`customer_contact_person_id`, `leads`.`sales_person_id`, `leads`.`lead_strength_id`, `leads`.`updated_at`, `leads`.`lead_created_on`, `leads`.`lead_completed_date`, `leads`.`is_completed`, `leads`.`is_active` from `leads` where `leads`.`is_completed` = '1'

    public static function dashBordPieCalculation($saleperson_id = '', $time = '') {
        $dashBordPie = Lead::select('leads.lead_strength_id', DB::raw('COUNT(leads.lead_strength_id) as LeadStreangthCount'), 'l.loan_type as lead_strength','l.color_code','l.key_details')
                ->leftjoin('lead_strengths as l', 'l.id', '=', 'leads.lead_strength_id');

        if (Auth::user()->user_type == 'SP')
        {
            $dashBordPie = $dashBordPie->where('leads.sales_person_id', '=', Auth::user()->id);
        }
        if ($saleperson_id != '' && $saleperson_id != 0) {
            $dashBordPie = $dashBordPie->where('leads.sales_person_id', '=', $saleperson_id);
        }
        if ($time == 1) {
            $dtime = date('Y-m-d', strtotime('-1 days'));
            $dashBordPie->where('leads.lead_created_on', '>=', $dtime);
        } else if ($time == 2) {
            $dtime = date('Y-m-d', strtotime('-7 days'));
            $dashBordPie->where('leads.lead_created_on', '>=', $dtime);
        } else if ($time == 3) {
            $dtime = date('Y-m-d', strtotime('-1 MONTH'));
            $dashBordPie->where('leads.lead_created_on', '>=', $dtime);
        } else if ($time == 4) {
            $dtime = date('Y-m-d', strtotime('-1 YEAR'));
            $dashBordPie->where('leads.lead_created_on', '>=', $dtime);
        }

        $dashBordPie = $dashBordPie->groupBy('leads.lead_strength_id')
                ->orderBy('leads.lead_strength_id', 'DESC')
                ->get()
                ->toArray();
---
select `leads`.`lead_strength_id`, COUNT(leads.lead_strength_id) as LeadStreangthCount, `l`.`loan_type` as `lead_strength`, `l`.`color_code`, `l`.`key_details` from `leads` left join `lead_strengths` as `l` on `l`.`id` = `leads`.`lead_strength_id` group by `leads`.`lead_strength_id` order by `leads`.`lead_strength_id` desc