app/model/Lead_strength.php

  public static function strengthlist()
  {
      $users = Lead_strength::select('*')
                 ->where('is_active', '=', '1')->orderBy('loan_type', 'ASC')->get();
---
select * from `lead_strengths` where `is_active` = '1' order by `loan_type` asc