app/model/Map_customer_salesperson.php

    public static function insertSP($id,$spid)
    {
        $fetch_data = Map_customer_salesperson::select('*')->where('customer_id', $id)->get()->toArray();
        //helper::pre($fetch_data, 1);
        Map_customer_salesperson::where('customer_id', '=', $id)->delete();

        $mapSP = new Map_customer_salesperson;
        $mapSP->customer_id = $id;
        $mapSP->user_id = $spid;
        if(count($fetch_data)>0){
        $mapSP->is_lead_on_hold = $fetch_data[0]['is_lead_on_hold'];
        $mapSP->lead_started_on = $fetch_data[0]['lead_started_on'];
        $mapSP->is_executive_for_life = $fetch_data[0]['is_executive_for_life'];
        }
        $mapSP->save();
---
select * from `map_customer_salespersons` where `customer_id` = '31'
delete from `map_customer_salespersons` where `customer_id` = '31'
insert into `map_customer_salespersons` (`customer_id`, `user_id`, `is_lead_on_hold`, `lead_started_on`, `is_executive_for_life`) values ('31', '33', '0', '2019-04-08 05:59:17', '1')

    public static function fetchSP($id)
    {
        $sp_details = Map_customer_salesperson::select('user_id')
                          ->where('customer_id', $id)
                          ->get();
---
select `user_id` from `map_customer_salespersons` where `customer_id` = '3'

    public static function non_exclusive_sp($id, $sp) {
        $lock_days = Website_setting::exclusive_lock_days();
        $date = date('Y-m-d H:i:s', strtotime('-' . $lock_days . ' days'));
        $sub_query = "(`lead_started_on` >'" . $date . "' or `lead_started_on` is null or `is_executive_for_life`=1)";
        $custom_ids = DB::table('map_customer_salespersons')->select('user_id')
                ->whereRaw($sub_query)
                ->distinct()
                ->orderBy('user_id', 'ASC')
                ->get();
        //helper::pre($custom_ids, 1);
        $lifetimeids = array();
        if ($custom_ids->count()) {
            $custom_ids = $custom_ids->toArray();

            foreach ($custom_ids as $actval) {
                if ($actval->user_id != $sp['user_id']){
                    array_push($lifetimeids, $actval->user_id);
                }
            }
        }

        $spData = User::select('*')
                        ->where('user_type', '=', 'SP')
                        ->where('is_active', '=', 1)
                        ->whereNotIn('id', $lifetimeids)
                        ->orderby('display_name', 'ASC')
                        ->get()->toArray();
---
select distinct `user_id` from `map_customer_salespersons` where (`lead_started_on` >'2019-02-11 07:30:58' or `lead_started_on` is null or `is_executive_for_life`=1) order by `user_id` asc
select * from `users` where `user_type` = 'SP' and `is_active` = '1' and `id` not in ('1', '2', '5', '6', '7', '12', '15', '20', '21', '22', '29') order by `display_name` asc

    public static function non_lock_exclusive_sp($id, $sp,$leaSaleperson) {
        $lock_days = Website_setting::exclusive_lock_days();
        $date = date('Y-m-d H:i:s', strtotime('-' . $lock_days . ' days'));
        $sub_query = "(`lead_started_on` >'" . $date . "' or `lead_started_on` is null or `is_executive_for_life`=1)";
        $custom_ids = DB::table('map_customer_salespersons')->select('user_id')
                ->whereRaw($sub_query)
                ->distinct()
                ->orderBy('user_id', 'ASC')
                ->get();
        //helper::pre($custom_ids, 1);
        $lifetimeids = array();
        if ($custom_ids->count()) {
            $custom_ids = $custom_ids->toArray();

            foreach ($custom_ids as $actval) {
                if (($actval->user_id != $sp['user_id'])&&($actval->user_id != $leaSaleperson)){
                    array_push($lifetimeids, $actval->user_id);
                }
            }
        }
        //helper::pre($lifetimeids, 1);
        $spData = User::select('*')
                        ->where('user_type', '=', 'SP')
                        ->where('is_active', '=', 1)
                        ->whereNotIn('id', $lifetimeids)
                        ->orderby('display_name', 'ASC')
                        ->get()->toArray();
---
select distinct `user_id` from `map_customer_salespersons` where (`lead_started_on` >'2019-02-11 08:09:55' or `lead_started_on` is null or `is_executive_for_life`=1) order by `user_id` asc
select * from `users` where `user_type` = 'SP' and `is_active` = '1' and `id` not in ('1', '2', '6', '7', '12', '15', '20', '21', '22', '29') order by `display_name` asc

     public static function check_is_executive_for_life($id){
          $fetch_data = Map_customer_salesperson::select('is_executive_for_life')->where('customer_id', $id)->first()->toArray();
---
select `is_executive_for_life` from `map_customer_salespersons` where `customer_id` = '32' limit 1