app/model/Product.php

    public static function activeproduct() {
        $activeproduct = Product::where('is_active', '=', '1')->orderBy('id', 'DESC')->get();
---
select * from `products` where `is_active` = '1' order by `id` desc

    public static function leadproduct($leadproducts) {
        $activeproduct = Product::whereIn('id',$leadproducts)->get();
---
select * from `products` where `id` in ('3', '10', '11')

    public static function changeStatus($id,$stat)
    {
        //echo $stat;exit;
        $cust_data = Product::find($id);
---
select * from `products` where 0 = 1

    public static function count_product()
    {
        $data = Product::select(DB::raw('COUNT(*) as product_count'))->where('is_active','=','1')->first()->toArray();
---
select COUNT(*) as product_count from `products` where `is_active` = '1' limit 1