app/model/Website_setting.php

select `customer_exclusive_lock_days` from `website_settings`
---
    public static function exclusive_lock_days() {
        $setting = Website_setting::select('customer_exclusive_lock_days')
                ->get();