app/model/Weekly_thermometer_record.php

select max(`week_number`) as aggregate from `weekly_thermometer_records` where `week_year` = '2019'
select * from `weekly_thermometer_records` where `week_year` = '2019' and `week_number` = '7'
---
    public static function weekly_5k_data($year){
        $maxid = Weekly_thermometer_record::where('week_year', '=', $year)->max('week_number');
         $result = Weekly_thermometer_record::select('*')
             ->where('week_year', '=', $year)
             ->where('week_number', '=', $maxid)
             ->get()
             ->toArray();