app/User.php

update `users` set `last_login_timestamp` = '2019-04-08 11:05:13am', `updated_at` = '2019-04-08 11:05:13' where `id` = '1'
---
    public static function update_last_login_time($id) {
        $time = date('Y-m-d H:i:sa');
        $users = User::where('id', $id)->update(['last_login_timestamp' => $time]);

select `id`, `display_name` from `users` where `user_type` = 'SP' order by `display_name` asc
---
    public static function selectuser($usertype) {
        $users = User::select('id', 'display_name')
                        ->where('user_type', '=', $usertype)->orderBy('display_name', 'ASC')->get();

select COUNT(*) as sales_person from `users` where `user_type` = 'SP' and `is_active` = '1' limit 1
---
    public static function count_active_sales_person() {
        $data = User::select(DB::raw('COUNT(*) as sales_person'))
                        ->where('user_type', '=', 'SP')
                        ->where('is_active', '=', '1')->first()->toArray();

select * from `users` where `user_type` = 'SP' order by `display_name` asc
---
    public static function all_sales_person() {
        $data = User::select('*')->where('user_type', '=', 'SP')->orderby('display_name', 'ASC')->get()->toArray();

select `id`, `display_name` from `users` where `user_type` = 'SP' and `is_active` = '1' order by `display_name` asc
---
    public static function selectactiveuser($usertype) {
        $users = User::select('id', 'display_name')
                        ->where('user_type', '=', $usertype)->where('is_active', '=', '1')->orderBy('display_name', 'ASC')->get();