app/Http/Controllers/Leadcontroller.php

            }

//            $lead_type = Lead_strength::find($post_data['strength'])->toArray();
            $lead_type = Lead_strength::find($post_data['strength']);
---
select * from `lead_strengths` where `lead_strengths`.`id` = '35' limit 1

                $customer_map = Map_customer_salesperson::where('customer_id', $decrypt_customer_id)->update(['is_lead_on_hold' => 1]);
            }
             else {
                $customer_map = Map_customer_salesperson::where('customer_id', $decrypt_customer_id)->update(['is_lead_on_hold' => 0,'lead_started_on' => date('Y-m-d H:i:s')]);
---
update `map_customer_salespersons` set `is_lead_on_hold` = '0', `lead_started_on` = '2019-04-08 07:50:18' where `customer_id` = '31'

        $perPage  = $this->items_per_page;
        $lead_details = Lead::fetchleads($perPage);
        $all_modes = Lead_activity_mode::fetchmodes();
        $lead_strengths= Lead_strength::all()->sortBy("loan_type")->toArray();
---
select * from `lead_strengths`