app/Http/Controllers/UsertypeController.php

        } else {
            $totalPaidValue = 0;
        }
        $target_setting = Website_setting::find(1)->toArray();
---
select * from `website_settings` where `website_settings`.`id` = '1' limit 1